In [31]:
import pandas as pd
import csv
import datetime as dt
from sqlalchemy import create_engine
from config import username, password

In [32]:
# Import Data
meteorites = pd.read_csv('Meteorite_Landings.csv')
main_category = pd.read_csv("recclass_categorization.csv")

In [33]:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/meteorites_db')

In [34]:
meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [35]:
meteorites_df = meteorites.dropna()

In [36]:
meteorites_df.count()

name           38115
id             38115
nametype       38115
recclass       38115
mass (g)       38115
fall           38115
year           38115
reclat         38115
reclong        38115
GeoLocation    38115
dtype: int64

In [37]:
meteorites.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass (g)', 'fall', 'year',
       'reclat', 'reclong', 'GeoLocation'],
      dtype='object')

In [38]:
df = meteorites_df.drop(columns=["GeoLocation","nametype"])

In [39]:
df

,name,id,recclass,mass (g),fall,year,reclat,reclong
0,Aachen,1,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333
1,Aarhus,2,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333
2,Abee,6,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000
3,Acapulco,10,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000
4,Achiras,370,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000
...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850
45712,Zinder,30409,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667
45713,Zlin,30410,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667
45714,Zubkovsky,31357,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460
45715,Zulu Queen,30414,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333

In [40]:
df.count()

name        38115
id          38115
recclass    38115
mass (g)    38115
fall        38115
year        38115
reclat      38115
reclong     38115
dtype: int64

In [41]:
df2 = df.loc[(df.reclat != 0) | (df.reclong != 0)].copy()

In [42]:
df2.count()

name        31929
id          31929
recclass    31929
mass (g)    31929
fall        31929
year        31929
reclat      31929
reclong     31929
dtype: int64

In [43]:
df2.head()

,name,id,recclass,mass (g),fall,year,reclat,reclong
0,Aachen,1,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333
1,Aarhus,2,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333
2,Abee,6,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000
3,Acapulco,10,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000
4,Achiras,370,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000

In [44]:
# Convert Year to YYYY
df2['year'] = df2['year'].str[6:10].astype(int)
print(df2['year'])

0        1880
1        1951
2        1952
3        1976
4        1902
         ...
45711    1990
45712    1999
45713    1939
45714    2003
45715    1976
Name: year, Length: 31929, dtype: int32

In [45]:
# Add main category to the dataframe
df2 = pd.merge(df2, main_category, on = "recclass")

# Change Col Name
df2 = df2.rename(columns = {'mass (g)':'mass', 'Main Category':'maincategory'})
df2.columns

Index(['name', 'id', 'recclass', 'mass', 'fall', 'year', 'reclat', 'reclong',
       'maincategory'],
      dtype='object')

In [46]:
# Removing the meteorites that contain numbers in the name
df3 = df2[df2['name'].str.contains("0") == False]
df4 = df3[df3['name'].str.contains("1") == False]
df5 = df4[df4['name'].str.contains("2") == False]
df6 = df5[df5['name'].str.contains("3") == False]
df7 = df6[df6['name'].str.contains("4") == False]
df8 = df7[df7['name'].str.contains("5") == False]
df9 = df8[df8['name'].str.contains("6") == False]
df10 = df9[df9['name'].str.contains("7") == False]
df11 = df10[df10['name'].str.contains("8") == False]
df12 = df11[df11['name'].str.contains("9") == False]
# Removing the years prior to 1700
df13 = df12[df12['year'] >= 1700]
df13

,name,id,recclass,mass,fall,year,reclat,reclong,maincategory
0,Aachen,1,L5,21.0,Fell,1880,50.775000,6.08333,Chondrite
1,Ausson,4903,L5,50000.0,Fell,1858,43.083330,0.58333,Chondrite
2,Banswal,4937,L5,14.0,Fell,1913,30.400000,78.20000,Chondrite
3,Barwell,4954,L5,44000.0,Fell,1965,52.565280,-1.33972,Chondrite
4,Baszkówka,4957,L5,15500.0,Fell,1994,52.033330,20.93583,Chondrite
...,...,...,...,...,...,...,...,...,...
30723,Suwahib (Buwah),23767,H3.8-an,241.0,Found,1931,20.055560,51.41667,Chondrite
30724,Willaroy,24272,H3.8-an,4030.0,Found,1970,-30.100000,143.20000,Chondrite
30725,Tafassasset,23779,CR-an,114000.0,Found,2000,20.763330,10.44167,Chondrite
30726,Watonga,55758,LL3.1,5025.0,Found,1960,35.833333,-98.40000,Chondrite
30728,Youxi,55793,Mesosiderite-C,218000.0,Found,2006,26.060000,118.01000,Mesosiderite

In [48]:
df13.to_sql('meteorites', con=engine)